name: "3-Tuple Network"

layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 9 dim: 224 dim: 224 } }
}


layer {
  name: "slicer_data"
  type: "Slice"
  bottom: "data"
  ## Data with a shape N x 9 x 224 x 224
  top: "data_positive_A"
  top: "data_positive_B"
  top: "data_query"
  slice_param {
    axis: 1
    slice_point: 3
    slice_point: 6
  }
}
##################################################
#### positive_A arm ####
##################################################
layer {
  name: "conv1/7x7_s2_positive_A"
  type: "Convolution"
  bottom: "data_positive_A"
  top: "conv1/7x7_s2_positive_A"
  param {
    name: "conv1/7x7_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1/7x7_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_7x7_positive_A"
  type: "ReLU"
  bottom: "conv1/7x7_s2_positive_A"
  top: "conv1/7x7_s2_positive_A"
}
layer {
  name: "pool1/3x3_s2_positive_A"
  type: "Pooling"
  bottom: "conv1/7x7_s2_positive_A"
  top: "pool1/3x3_s2_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1_positive_A"
  type: "LRN"
  bottom: "pool1/3x3_s2_positive_A"
  top: "pool1/norm1_positive_A"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "pool1/norm1_positive_A"
  top: "conv2/3x3_reduce_positive_A"
  param {
    name: "conv2/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "conv2/3x3_reduce_positive_A"
  top: "conv2/3x3_reduce_positive_A"
}
layer {
  name: "conv2/3x3_positive_A"
  type: "Convolution"
  bottom: "conv2/3x3_reduce_positive_A"
  top: "conv2/3x3_positive_A"
  param {
    name: "conv2/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "conv2/3x3_positive_A"
  top: "conv2/3x3_positive_A"
}
layer {
  name: "conv2/norm2_positive_A"
  type: "LRN"
  bottom: "conv2/3x3_positive_A"
  top: "conv2/norm2_positive_A"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2_positive_A"
  type: "Pooling"
  bottom: "conv2/norm2_positive_A"
  top: "pool2/3x3_s2_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1_positive_A"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_A"
  top: "inception_3a/1x1_positive_A"
  param {
    name: "inception_3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_3a/1x1_positive_A"
  top: "inception_3a/1x1_positive_A"
}
layer {
  name: "inception_3a/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_A"
  top: "inception_3a/3x3_reduce_positive_A"
  param {
    name: "inception_3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_positive_A"
  top: "inception_3a/3x3_reduce_positive_A"
}
layer {
  name: "inception_3a/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_positive_A"
  top: "inception_3a/3x3_positive_A"
  param {
    name: "inception_3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_3a/3x3_positive_A"
  top: "inception_3a/3x3_positive_A"
}
layer {
  name: "inception_3a/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_A"
  top: "inception_3a/5x5_reduce_positive_A"
  param {
    name: "inception_3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_positive_A"
  top: "inception_3a/5x5_reduce_positive_A"
}
layer {
  name: "inception_3a/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_positive_A"
  top: "inception_3a/5x5_positive_A"
  param {
    name: "inception_3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_3a/5x5_positive_A"
  top: "inception_3a/5x5_positive_A"
}
layer {
  name: "inception_3a/pool_positive_A"
  type: "Pooling"
  bottom: "pool2/3x3_s2_positive_A"
  top: "inception_3a/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_3a/pool_positive_A"
  top: "inception_3a/pool_proj_positive_A"
  param {
    name: "inception_3a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_3a/pool_proj_positive_A"
  top: "inception_3a/pool_proj_positive_A"
}
layer {
  name: "inception_3a/output_positive_A"
  type: "Concat"
  bottom: "inception_3a/1x1_positive_A"
  bottom: "inception_3a/3x3_positive_A"
  bottom: "inception_3a/5x5_positive_A"
  bottom: "inception_3a/pool_proj_positive_A"
  top: "inception_3a/output_positive_A"
}
layer {
  name: "inception_3b/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_3a/output_positive_A"
  top: "inception_3b/1x1_positive_A"
  param {
    name: "inception_3b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_3b/1x1_positive_A"
  top: "inception_3b/1x1_positive_A"
}
layer {
  name: "inception_3b/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_3a/output_positive_A"
  top: "inception_3b/3x3_reduce_positive_A"
  param {
    name: "inception_3b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_3b/3x3_reduce_positive_A"
  top: "inception_3b/3x3_reduce_positive_A"
}
layer {
  name: "inception_3b/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_3b/3x3_reduce_positive_A"
  top: "inception_3b/3x3_positive_A"
  param {
    name: "inception_3b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_3b/3x3_positive_A"
  top: "inception_3b/3x3_positive_A"
}
layer {
  name: "inception_3b/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_3a/output_positive_A"
  top: "inception_3b/5x5_reduce_positive_A"
  param {
    name: "inception_3b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_3b/5x5_reduce_positive_A"
  top: "inception_3b/5x5_reduce_positive_A"
}
layer {
  name: "inception_3b/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_3b/5x5_reduce_positive_A"
  top: "inception_3b/5x5_positive_A"
  param {
    name: "inception_3b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_3b/5x5_positive_A"
  top: "inception_3b/5x5_positive_A"
}
layer {
  name: "inception_3b/pool_positive_A"
  type: "Pooling"
  bottom: "inception_3a/output_positive_A"
  top: "inception_3b/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3b/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_3b/pool_positive_A"
  top: "inception_3b/pool_proj_positive_A"
  param {
    name: "inception_3b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3b/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_3b/pool_proj_positive_A"
  top: "inception_3b/pool_proj_positive_A"
}
layer {
  name: "inception_3b/output_positive_A"
  type: "Concat"
  bottom: "inception_3b/1x1_positive_A"
  bottom: "inception_3b/3x3_positive_A"
  bottom: "inception_3b/5x5_positive_A"
  bottom: "inception_3b/pool_proj_positive_A"
  top: "inception_3b/output_positive_A"
}
layer {
  name: "pool3/3x3_s2_positive_A"
  type: "Pooling"
  bottom: "inception_3b/output_positive_A"
  top: "pool3/3x3_s2_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_4a/1x1_positive_A"
  type: "Convolution"
  bottom: "pool3/3x3_s2_positive_A"
  top: "inception_4a/1x1_positive_A"
  param {
    name: "inception_4a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_4a/1x1_positive_A"
  top: "inception_4a/1x1_positive_A"
}
layer {
  name: "inception_4a/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "pool3/3x3_s2_positive_A"
  top: "inception_4a/3x3_reduce_positive_A"
  param {
    name: "inception_4a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4a/3x3_reduce_positive_A"
  top: "inception_4a/3x3_reduce_positive_A"
}
layer {
  name: "inception_4a/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_4a/3x3_reduce_positive_A"
  top: "inception_4a/3x3_positive_A"
  param {
    name: "inception_4a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_4a/3x3_positive_A"
  top: "inception_4a/3x3_positive_A"
}
layer {
  name: "inception_4a/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "pool3/3x3_s2_positive_A"
  top: "inception_4a/5x5_reduce_positive_A"
  param {
    name: "inception_4a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4a/5x5_reduce_positive_A"
  top: "inception_4a/5x5_reduce_positive_A"
}
layer {
  name: "inception_4a/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_4a/5x5_reduce_positive_A"
  top: "inception_4a/5x5_positive_A"
  param {
    name: "inception_4a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_4a/5x5_positive_A"
  top: "inception_4a/5x5_positive_A"
}
layer {
  name: "inception_4a/pool_positive_A"
  type: "Pooling"
  bottom: "pool3/3x3_s2_positive_A"
  top: "inception_4a/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4a/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_4a/pool_positive_A"
  top: "inception_4a/pool_proj_positive_A"
  param {
    name: "inception_4a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4a/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_4a/pool_proj_positive_A"
  top: "inception_4a/pool_proj_positive_A"
}
layer {
  name: "inception_4a/output_positive_A"
  type: "Concat"
  bottom: "inception_4a/1x1_positive_A"
  bottom: "inception_4a/3x3_positive_A"
  bottom: "inception_4a/5x5_positive_A"
  bottom: "inception_4a/pool_proj_positive_A"
  top: "inception_4a/output_positive_A"
}

layer {
  name: "inception_4b/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_4a/output_positive_A"
  top: "inception_4b/1x1_positive_A"
  param {
    name: "inception_4b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_4b/1x1_positive_A"
  top: "inception_4b/1x1_positive_A"
}
layer {
  name: "inception_4b/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4a/output_positive_A"
  top: "inception_4b/3x3_reduce_positive_A"
  param {
    name: "inception_4b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4b/3x3_reduce_positive_A"
  top: "inception_4b/3x3_reduce_positive_A"
}
layer {
  name: "inception_4b/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_4b/3x3_reduce_positive_A"
  top: "inception_4b/3x3_positive_A"
  param {
    name: "inception_4b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_4b/3x3_positive_A"
  top: "inception_4b/3x3_positive_A"
}
layer {
  name: "inception_4b/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4a/output_positive_A"
  top: "inception_4b/5x5_reduce_positive_A"
  param {
    name: "inception_4b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4b/5x5_reduce_positive_A"
  top: "inception_4b/5x5_reduce_positive_A"
}
layer {
  name: "inception_4b/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_4b/5x5_reduce_positive_A"
  top: "inception_4b/5x5_positive_A"
  param {
    name: "inception_4b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_4b/5x5_positive_A"
  top: "inception_4b/5x5_positive_A"
}
layer {
  name: "inception_4b/pool_positive_A"
  type: "Pooling"
  bottom: "inception_4a/output_positive_A"
  top: "inception_4b/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4b/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_4b/pool_positive_A"
  top: "inception_4b/pool_proj_positive_A"
  param {
    name: "inception_4b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4b/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_4b/pool_proj_positive_A"
  top: "inception_4b/pool_proj_positive_A"
}
layer {
  name: "inception_4b/output_positive_A"
  type: "Concat"
  bottom: "inception_4b/1x1_positive_A"
  bottom: "inception_4b/3x3_positive_A"
  bottom: "inception_4b/5x5_positive_A"
  bottom: "inception_4b/pool_proj_positive_A"
  top: "inception_4b/output_positive_A"
}
layer {
  name: "inception_4c/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_4b/output_positive_A"
  top: "inception_4c/1x1_positive_A"
  param {
    name: "inception_4c/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_4c/1x1_positive_A"
  top: "inception_4c/1x1_positive_A"
}
layer {
  name: "inception_4c/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4b/output_positive_A"
  top: "inception_4c/3x3_reduce_positive_A"
  param {
    name: "inception_4c/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4c/3x3_reduce_positive_A"
  top: "inception_4c/3x3_reduce_positive_A"
}
layer {
  name: "inception_4c/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_4c/3x3_reduce_positive_A"
  top: "inception_4c/3x3_positive_A"
  param {
    name: "inception_4c/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_4c/3x3_positive_A"
  top: "inception_4c/3x3_positive_A"
}
layer {
  name: "inception_4c/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4b/output_positive_A"
  top: "inception_4c/5x5_reduce_positive_A"
  param {
    name: "inception_4c/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4c/5x5_reduce_positive_A"
  top: "inception_4c/5x5_reduce_positive_A"
}
layer {
  name: "inception_4c/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_4c/5x5_reduce_positive_A"
  top: "inception_4c/5x5_positive_A"
  param {
    name: "inception_4c/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_4c/5x5_positive_A"
  top: "inception_4c/5x5_positive_A"
}
layer {
  name: "inception_4c/pool_positive_A"
  type: "Pooling"
  bottom: "inception_4b/output_positive_A"
  top: "inception_4c/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4c/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_4c/pool_positive_A"
  top: "inception_4c/pool_proj_positive_A"
  param {
    name: "inception_4c/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4c/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4c/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_4c/pool_proj_positive_A"
  top: "inception_4c/pool_proj_positive_A"
}
layer {
  name: "inception_4c/output_positive_A"
  type: "Concat"
  bottom: "inception_4c/1x1_positive_A"
  bottom: "inception_4c/3x3_positive_A"
  bottom: "inception_4c/5x5_positive_A"
  bottom: "inception_4c/pool_proj_positive_A"
  top: "inception_4c/output_positive_A"
}
layer {
  name: "inception_4d/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_4c/output_positive_A"
  top: "inception_4d/1x1_positive_A"
  param {
    name: "inception_4d/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_4d/1x1_positive_A"
  top: "inception_4d/1x1_positive_A"
}
layer {
  name: "inception_4d/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4c/output_positive_A"
  top: "inception_4d/3x3_reduce_positive_A"
  param {
    name: "inception_4d/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4d/3x3_reduce_positive_A"
  top: "inception_4d/3x3_reduce_positive_A"
}
layer {
  name: "inception_4d/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_4d/3x3_reduce_positive_A"
  top: "inception_4d/3x3_positive_A"
  param {
    name: "inception_4d/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_4d/3x3_positive_A"
  top: "inception_4d/3x3_positive_A"
}
layer {
  name: "inception_4d/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4c/output_positive_A"
  top: "inception_4d/5x5_reduce_positive_A"
  param {
    name: "inception_4d/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4d/5x5_reduce_positive_A"
  top: "inception_4d/5x5_reduce_positive_A"
}
layer {
  name: "inception_4d/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_4d/5x5_reduce_positive_A"
  top: "inception_4d/5x5_positive_A"
  param {
    name: "inception_4d/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_4d/5x5_positive_A"
  top: "inception_4d/5x5_positive_A"
}
layer {
  name: "inception_4d/pool_positive_A"
  type: "Pooling"
  bottom: "inception_4c/output_positive_A"
  top: "inception_4d/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4d/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_4d/pool_positive_A"
  top: "inception_4d/pool_proj_positive_A"
  param {
    name: "inception_4d/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4d/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4d/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_4d/pool_proj_positive_A"
  top: "inception_4d/pool_proj_positive_A"
}
layer {
  name: "inception_4d/output_positive_A"
  type: "Concat"
  bottom: "inception_4d/1x1_positive_A"
  bottom: "inception_4d/3x3_positive_A"
  bottom: "inception_4d/5x5_positive_A"
  bottom: "inception_4d/pool_proj_positive_A"
  top: "inception_4d/output_positive_A"
}

layer {
  name: "inception_4e/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_4d/output_positive_A"
  top: "inception_4e/1x1_positive_A"
  param {
    name: "inception_4e/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_4e/1x1_positive_A"
  top: "inception_4e/1x1_positive_A"
}
layer {
  name: "inception_4e/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4d/output_positive_A"
  top: "inception_4e/3x3_reduce_positive_A"
  param {
    name: "inception_4e/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4e/3x3_reduce_positive_A"
  top: "inception_4e/3x3_reduce_positive_A"
}
layer {
  name: "inception_4e/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_4e/3x3_reduce_positive_A"
  top: "inception_4e/3x3_positive_A"
  param {
    name: "inception_4e/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_4e/3x3_positive_A"
  top: "inception_4e/3x3_positive_A"
}
layer {
  name: "inception_4e/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_4d/output_positive_A"
  top: "inception_4e/5x5_reduce_positive_A"
  param {
    name: "inception_4e/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_4e/5x5_reduce_positive_A"
  top: "inception_4e/5x5_reduce_positive_A"
}
layer {
  name: "inception_4e/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_4e/5x5_reduce_positive_A"
  top: "inception_4e/5x5_positive_A"
  param {
    name: "inception_4e/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_4e/5x5_positive_A"
  top: "inception_4e/5x5_positive_A"
}
layer {
  name: "inception_4e/pool_positive_A"
  type: "Pooling"
  bottom: "inception_4d/output_positive_A"
  top: "inception_4e/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_4e/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_4e/pool_positive_A"
  top: "inception_4e/pool_proj_positive_A"
  param {
    name: "inception_4e/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_4e/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_4e/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_4e/pool_proj_positive_A"
  top: "inception_4e/pool_proj_positive_A"
}
layer {
  name: "inception_4e/output_positive_A"
  type: "Concat"
  bottom: "inception_4e/1x1_positive_A"
  bottom: "inception_4e/3x3_positive_A"
  bottom: "inception_4e/5x5_positive_A"
  bottom: "inception_4e/pool_proj_positive_A"
  top: "inception_4e/output_positive_A"
}
layer {
  name: "pool4/3x3_s2_positive_A"
  type: "Pooling"
  bottom: "inception_4e/output_positive_A"
  top: "pool4/3x3_s2_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_5a/1x1_positive_A"
  type: "Convolution"
  bottom: "pool4/3x3_s2_positive_A"
  top: "inception_5a/1x1_positive_A"
  param {
    name: "inception_5a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_5a/1x1_positive_A"
  top: "inception_5a/1x1_positive_A"
}
layer {
  name: "inception_5a/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "pool4/3x3_s2_positive_A"
  top: "inception_5a/3x3_reduce_positive_A"
  param {
    name: "inception_5a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_5a/3x3_reduce_positive_A"
  top: "inception_5a/3x3_reduce_positive_A"
}
layer {
  name: "inception_5a/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_5a/3x3_reduce_positive_A"
  top: "inception_5a/3x3_positive_A"
  param {
    name: "inception_5a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_5a/3x3_positive_A"
  top: "inception_5a/3x3_positive_A"
}
layer {
  name: "inception_5a/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "pool4/3x3_s2_positive_A"
  top: "inception_5a/5x5_reduce_positive_A"
  param {
    name: "inception_5a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_5a/5x5_reduce_positive_A"
  top: "inception_5a/5x5_reduce_positive_A"
}
layer {
  name: "inception_5a/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_5a/5x5_reduce_positive_A"
  top: "inception_5a/5x5_positive_A"
  param {
    name: "inception_5a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_5a/5x5_positive_A"
  top: "inception_5a/5x5_positive_A"
}
layer {
  name: "inception_5a/pool_positive_A"
  type: "Pooling"
  bottom: "pool4/3x3_s2_positive_A"
  top: "inception_5a/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5a/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_5a/pool_positive_A"
  top: "inception_5a/pool_proj_positive_A"
  param {
    name: "inception_5a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5a/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5a/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_5a/pool_proj_positive_A"
  top: "inception_5a/pool_proj_positive_A"
}
layer {
  name: "inception_5a/output_positive_A"
  type: "Concat"
  bottom: "inception_5a/1x1_positive_A"
  bottom: "inception_5a/3x3_positive_A"
  bottom: "inception_5a/5x5_positive_A"
  bottom: "inception_5a/pool_proj_positive_A"
  top: "inception_5a/output_positive_A"
}
layer {
  name: "inception_5b/1x1_positive_A"
  type: "Convolution"
  bottom: "inception_5a/output_positive_A"
  top: "inception_5b/1x1_positive_A"
  param {
    name: "inception_5b/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_1x1_positive_A"
  type: "ReLU"
  bottom: "inception_5b/1x1_positive_A"
  top: "inception_5b/1x1_positive_A"
}
layer {
  name: "inception_5b/3x3_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_5a/output_positive_A"
  top: "inception_5b/3x3_reduce_positive_A"
  param {
    name: "inception_5b/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_5b/3x3_reduce_positive_A"
  top: "inception_5b/3x3_reduce_positive_A"
}
layer {
  name: "inception_5b/3x3_positive_A"
  type: "Convolution"
  bottom: "inception_5b/3x3_reduce_positive_A"
  top: "inception_5b/3x3_positive_A"
  param {
    name: "inception_5b/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_3x3_positive_A"
  type: "ReLU"
  bottom: "inception_5b/3x3_positive_A"
  top: "inception_5b/3x3_positive_A"
}
layer {
  name: "inception_5b/5x5_reduce_positive_A"
  type: "Convolution"
  bottom: "inception_5a/output_positive_A"
  top: "inception_5b/5x5_reduce_positive_A"
  param {
    name: "inception_5b/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_reduce_positive_A"
  type: "ReLU"
  bottom: "inception_5b/5x5_reduce_positive_A"
  top: "inception_5b/5x5_reduce_positive_A"
}
layer {
  name: "inception_5b/5x5_positive_A"
  type: "Convolution"
  bottom: "inception_5b/5x5_reduce_positive_A"
  top: "inception_5b/5x5_positive_A"
  param {
    name: "inception_5b/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_5x5_positive_A"
  type: "ReLU"
  bottom: "inception_5b/5x5_positive_A"
  top: "inception_5b/5x5_positive_A"
}
layer {
  name: "inception_5b/pool_positive_A"
  type: "Pooling"
  bottom: "inception_5a/output_positive_A"
  top: "inception_5b/pool_positive_A"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_5b/pool_proj_positive_A"
  type: "Convolution"
  bottom: "inception_5b/pool_positive_A"
  top: "inception_5b/pool_proj_positive_A"
  param {
    name: "inception_5b/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_5b/pool_proj_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_5b/relu_pool_proj_positive_A"
  type: "ReLU"
  bottom: "inception_5b/pool_proj_positive_A"
  top: "inception_5b/pool_proj_positive_A"
}
layer {
  name: "inception_5b/output_positive_A"
  type: "Concat"
  bottom: "inception_5b/1x1_positive_A"
  bottom: "inception_5b/3x3_positive_A"
  bottom: "inception_5b/5x5_positive_A"
  bottom: "inception_5b/pool_proj_positive_A"
  top: "inception_5b/output_positive_A"
}
layer {
  name: "pool5/7x7_s1_positive_A"
  type: "Pooling"
  bottom: "inception_5b/output_positive_A"
  top: "pool5/7x7_s1_positive_A"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}

##################################################
#### positive_B arm ####
##################################################
layer {
  name: "conv1/7x7_s2_positive_B"
  type: "Convolution"
  bottom: "data_positive_B"
  top: "conv1/7x7_s2_positive_B"
  param {
    name: "conv1/7x7_s2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1/7x7_s2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv1/relu_7x7_positive_B"
  type: "ReLU"
  bottom: "conv1/7x7_s2_positive_B"
  top: "conv1/7x7_s2_positive_B"
}
layer {
  name: "pool1/3x3_s2_positive_B"
  type: "Pooling"
  bottom: "conv1/7x7_s2_positive_B"
  top: "pool1/3x3_s2_positive_B"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "pool1/norm1_positive_B"
  type: "LRN"
  bottom: "pool1/3x3_s2_positive_B"
  top: "pool1/norm1_positive_B"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2/3x3_reduce_positive_B"
  type: "Convolution"
  bottom: "pool1/norm1_positive_B"
  top: "conv2/3x3_reduce_positive_B"
  param {
    name: "conv2/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_reduce_positive_B"
  type: "ReLU"
  bottom: "conv2/3x3_reduce_positive_B"
  top: "conv2/3x3_reduce_positive_B"
}
layer {
  name: "conv2/3x3_positive_B"
  type: "Convolution"
  bottom: "conv2/3x3_reduce_positive_B"
  top: "conv2/3x3_positive_B"
  param {
    name: "conv2/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "conv2/relu_3x3_positive_B"
  type: "ReLU"
  bottom: "conv2/3x3_positive_B"
  top: "conv2/3x3_positive_B"
}
layer {
  name: "conv2/norm2_positive_B"
  type: "LRN"
  bottom: "conv2/3x3_positive_B"
  top: "conv2/norm2_positive_B"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2/3x3_s2_positive_B"
  type: "Pooling"
  bottom: "conv2/norm2_positive_B"
  top: "pool2/3x3_s2_positive_B"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "inception_3a/1x1_positive_B"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_B"
  top: "inception_3a/1x1_positive_B"
  param {
    name: "inception_3a/1x1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/1x1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_1x1_positive_B"
  type: "ReLU"
  bottom: "inception_3a/1x1_positive_B"
  top: "inception_3a/1x1_positive_B"
}
layer {
  name: "inception_3a/3x3_reduce_positive_B"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_B"
  top: "inception_3a/3x3_reduce_positive_B"
  param {
    name: "inception_3a/3x3_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_reduce_positive_B"
  type: "ReLU"
  bottom: "inception_3a/3x3_reduce_positive_B"
  top: "inception_3a/3x3_reduce_positive_B"
}
layer {
  name: "inception_3a/3x3_positive_B"
  type: "Convolution"
  bottom: "inception_3a/3x3_reduce_positive_B"
  top: "inception_3a/3x3_positive_B"
  param {
    name: "inception_3a/3x3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/3x3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_3x3_positive_B"
  type: "ReLU"
  bottom: "inception_3a/3x3_positive_B"
  top: "inception_3a/3x3_positive_B"
}
layer {
  name: "inception_3a/5x5_reduce_positive_B"
  type: "Convolution"
  bottom: "pool2/3x3_s2_positive_B"
  top: "inception_3a/5x5_reduce_positive_B"
  param {
    name: "inception_3a/5x5_reduce_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_reduce_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_reduce_positive_B"
  type: "ReLU"
  bottom: "inception_3a/5x5_reduce_positive_B"
  top: "inception_3a/5x5_reduce_positive_B"
}
layer {
  name: "inception_3a/5x5_positive_B"
  type: "Convolution"
  bottom: "inception_3a/5x5_reduce_positive_B"
  top: "inception_3a/5x5_positive_B"
  param {
    name: "inception_3a/5x5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/5x5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "inception_3a/relu_5x5_positive_B"
  type: "ReLU"
  bottom: "inception_3a/5x5_positive_B"
  top: "inception_3a/5x5_positive_B"
}
layer {
  name: "inception_3a/pool_positive_B"
  type: "Pooling"
  bottom: "pool2/3x3_s2_positive_B"
  top: "inception_3a/pool_positive_B"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "inception_3a/pool_proj_positive_B"
  type: "Convolution"
  bottom: "inception_3a/pool_positive_B"
  top: "inception_3a/pool_proj_positive_B"
  param {
    name: "inception_3a/pool_proj_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "inception_3a/pool_proj_b"
    lr_mult: 2
